### 1. What will be the output of the following Python program?

In [6]:
def foo(x):
    x[0]=['def']       # The function foo(q) modifies q inside the function by changing q[0] to ['def'] and q[1] to ['abc'].
    x[1]=['abc']
    return id(x)     # q is a list containing two strings, 'abc' and 'def'.
q=['abc','def']       # Initially, q is ['abc', 'def'].

In [7]:
print(id(q)==foo(q)) # The expression id(q) == foo(q) checks if the memory address of q is equal to the result of foo(q)

True

### 2. What will be the output of the following Python code?

In [4]:
def fun():
    try:
        return 1   # try block: The code inside the try block attempts to execute, and it contains the statement return 1
    finally:
        return 2 # finally block: The finally block always executes, 
# regardless of whether there was an error in the try block or not

In [5]:
k=fun()
print(k)  # This means that, no matter what happens in the try block, the function will always return the value 2

2

### 3. What will be the output of the following code snippet?

In [8]:
def func():  # global value: Inside the function, there is a global keyword followed by the variable name value.
    global value 
    value = "local"

In [9]:
value = "global"

In [10]:
func()  # When the function is called, it updates the global variable value to "local".
print(value) 
# After the function call, when you print the value of the global variable value, 
#it will be "local" because the function modified the global variable.

local

### 4. ___________ exception are raised as a result of an error in opening a particular file.

a)value error
 
b)type error

c)import errror
 
d)ioerror

d)ioerror
# In Python, IOError is raised when an error occurs while performing input/output operations, such as when there's an issue opening or accessing a file. 
# So, if there is an error in opening a particular file, Python will raise an IOError exception.

### 5. In python we do not specify types, it is directly interpreted by the compiler, so consider the following operation to be performed.

a) x=13//2

b) x=int(13/2)

c) x=13%2

d) All of the mentioned

In [3]:
x=13//2
x

6

In [5]:
x=int(13/2)
x

6

In [6]:
x=13%2
x

1

d) all of the mentioned

### 6. What will be the output of the following Python code?

In [1]:
t[5] # NameError: name 't' is not defined

NameError: name 't' is not defined

### 7. A while loop in Python is used for what type of iteration?

a) indefinite

b) discriminant

c) definite

d) indeterminate

In [2]:
count = 0        # A while loop in Python is used for indefinite iteration

while count < 5:   # it continues to execute as long as a specified condition is true
    print("Count is:", count)
    count += 1

Count is: 0
Count is: 1
Count is: 2
Count is: 3
Count is: 4

### 8. What will be the output of the following Python code?

In [12]:
x="abcdef"

In [14]:
while i in x:
    print(i,end="") 
# The code you provided has a logical error. It seems like you are trying to iterate over the characters in the string x,
# but the variable i is not defined before using it in the loop.

TypeError: 'in <string>' requires string as left operand, not int

### 9. What is the main advantage of using decorators in Python?

a) They make the code more complex

b) They simplify the syntax of the decorated functions

c) They reduce the performance of the code 

d) They provide additional security features

b) They simplify the syntax of decorated functions

# Decorators in Python offer a concise and readable way to modify or extend the behavior of functions or methods. 
# They provide a clean and reusable way to wrap or enhance the functionality of functions

### 10. If return statement is not used inside the function, the function will return:

a) None

b) 0

c) Null

d) Arbitary value

a) None

# If a return statement is not used in a function, Python implicitly returns None by default.
# if the function completes its execution without encountering a return statement, it effectively returns None.

### 11. What is called when a function is defined inside a class?

a) class

b) function

e) method

d) module

c) method

# When a function is defined inside a class in Python, it is referred to as a method

### 12. Which operator is used in Python to import modules from packages?

a).

b)*

c)->

d)&

a)

# the dot (.) operator is used to import modules from packages. 
# The dot operator is used to navigate the hierarchy of packages and access the modules contained within them.

### 13. 

def getMonth(s):
    
    if m<1 or m 12: 
        
        raise ValueError("Invalid") 
    
    print (m)

In [17]:
def getmonth(m): # The getMonth function takes a month parameter (m)
    if m<1 or m>12: # It checks if the month is invalid (less than 1 or greater than 12)
        raise ValueError("invalid") #  and if so it raises a ValueError with the message "Invalid".

In [20]:
getmonth(6) 
# If the month is valid, it prints the month value. The function is then called with the argument 6.

### 14. in the python programming language, syntax error is detected by _________at ___________

a)interpreter/compile time

b)run time/interpreter 

c)interpreter/ run time

d)compile time/ run time

d) compile time/ run time
#Syntax errors in Python are detected by the interpreter during the compilation phase, which occurs before the code is run.

### 15. 

class Book:
    
    def init (self,author):
        
        self.author author

book1 Book("V.M.Shah")

book2=book1

a) Both book1 and book2 will have reference to two different objects of class Book 

b) id(book1) and id(book2) will have same value

c) It will throw error as multiple references to same object is not possible

d) None of the above

In [2]:
class  Book: # A class named Book is defined .
    def __init__(self,author): # with a constructor method init taking self and author parameters. 
    
        self.author=author #It initializes the instance's author attribute.

In [3]:
book1=Book("V.M.shah") # An instance, book1, is created with the author 'V.M.Shah' and assigned to book1.

In [4]:
book2=book1 # book2 is then assigned the same instance as book1.

In [5]:
book1 
# Both variables, book1 and book2, reference the same Book class instance.
# Changes made through one variable will affect the other.

In [7]:
id(book1)

1710436074512

In [8]:
id(book2)

1710436074512

b) id(book1) and id(book2) will have the same value
# When you assign book1 to book2, both variables refer to the same object, and therefore, 
# the id() values for book1 and book2 will be the same.

### 16. How to Create a new column Revenue which has value equals to the Quantity * UnitPrice of the current row

In [4]:
import pandas as pd 
df = pd.read_csv(r'D:\python\extra\19_12_2023\assessment\data.csv')
df

        Date  Category     Product CustomerID  Quantity  UnitPrice
0   1/1/2024  Beverage  Cappuccino       C004         1        3.0
1   1/2/2024      Food   Croissant       C002         2        2.0
2   1/3/2024  Beverage    Espresso       C001         2        2.0
3  1/10/2024  Beverage       Latte       C001         3        3.5
4   1/9/2024  Beverage      Lattte       C003         1        3.5
5   1/8/2024      Food      Muffin       C002         1        2.5

a) df['Revenue'] = df['Quantity'] * df['UnitPrice']

In [8]:
df['Revenue'] = df['Quantity'] * df['UnitPrice']  # This creates a new column named 'Revenue'
df['Revenue'] #in the DataFrame df and assigns it the values obtained from the multiplication operation.

0     3.0
1     4.0
2     4.0
3    10.5
4     3.5
5     2.5
Name: Revenue, dtype: float64

In [9]:
df # revenue created

        Date  Category     Product CustomerID  Quantity  UnitPrice  Revenue
0   1/1/2024  Beverage  Cappuccino       C004         1        3.0      3.0
1   1/2/2024      Food   Croissant       C002         2        2.0      4.0
2   1/3/2024  Beverage    Espresso       C001         2        2.0      4.0
3  1/10/2024  Beverage       Latte       C001         3        3.5     10.5
4   1/9/2024  Beverage      Lattte       C003         1        3.5      3.5
5   1/8/2024      Food      Muffin       C002         1        2.5      2.5

### 17. What is the syntax to find Categorical wise revenue

b) df.groupby('Category')['Revenue'].sum()

In [10]:
df.groupby('Category')['Revenue'].sum()

Category
Beverage    21.0
Food         6.5
Name: Revenue, dtype: float64

### 18. To find the average quantity wrt t date and product what is the correct syntax?

b) df.groupby(['Date', 'Product'])['Quantity'].mean()

In [11]:
df.groupby(['Date', 'Product'])['Quantity'].mean()

Date       Product
1/1/2024   Cappuccino    1.0
1/10/2024  Latte         3.0
1/2/2024   Croissant     2.0
1/3/2024   Espresso      2.0
1/8/2024   Muffin        1.0
1/9/2024   Lattte        1.0
Name: Quantity, dtype: float64

### 19. Categorical wise revenue for Bevarage and Food respectively are

In [12]:
df.groupby('Category')['Revenue'].sum()

Category
Beverage    21.0
Food         6.5
Name: Revenue, dtype: float64

### 20. Using transform, What is the syntax to create a column which has a unitprice difference wrt its category mean

a) df.groupby("category")["unitprice"].transform(lambda x: x - x.mean())

In [16]:
df.groupby("Category")["UnitPrice"].transform(lambda x: x - x.mean())

0    0.00
1   -0.25
2   -1.00
3    0.50
4    0.50
5    0.25
Name: UnitPrice, dtype: float64

# df.groupby("category"): Groups the DataFrame by the 'category' column
# ["unitprice"]: Selects the 'unitprice' column from the grouped data
# .transform(lambda x: x - x.mean()): Applies a lambda function to calculate the difference between each unit price (x) and the mean unit price of its category.

### 21. What is the correct syntax to get data wrt 'Monday'

a) df.groupby(df.Date.dt.day_name()).get_group("Monday")

In [20]:
df['Date'] = pd.to_datetime(df['Date'])

In [22]:
df.groupby(df.Date.dt.day_name()).get_group('Monday')
# This syntax correctly uses the groupby method with the get_group method 
# to filter the DataFrame for data corresponding to Mondays based on the day name.

        Date  Category     Product CustomerID  Quantity  UnitPrice  Revenue
0 2024-01-01  Beverage  Cappuccino       C004         1        3.0      3.0
5 2024-01-08      Food      Muffin       C002         1        2.5      2.5

### 22. Which of the following statements is / are true

d) apply applies the function one cell at a time

# The apply function in pandas can be applied to a Series or DataFrame. 
#When applied to a Series, it operates on each element of the Series.
#When applied to a DataFrame, it can operate on either rows or columns, depending on the specified axis.

### 23. Which of the following statements is / are true

b) applymap applies the functionality on each element of the DataFrame, whether it's a row or a column.

# map is used for element-wise transformations on a Series.
# apply can be used to apply a function along the axis of a DataFrame, either on rows or columns, based on the specified axis parameter.
# applymap is specifically designed for element-wise operations on DataFrames.

### 24. create a pivot table with index ass Nort and South and Columns as Product Where values are sum of Quantities Sold

In [23]:
data = {
    'Date': ['2024-01-10', '2024-01-11', '2024-01-10','2024-01-12','2024-01-11','2024-01-12'],
    'Region': ['North', 'South', 'East','West','North','East'],
    'Salesperson': ['Ajay', 'Balu', 'Chirag','Ajay','Balu','Chiraj'],
    'Product': ['Notebook', 'Pen', 'Notebook','Pen','Binder','Binder'],
    'Quantity': [5, 10, 7,15,20,10],
    'UnitPrice': [12, 3, 12,3,5,5]
}

df1= pd.DataFrame(data)

df1

         Date Region Salesperson   Product  Quantity  UnitPrice
0  2024-01-10  North        Ajay  Notebook         5         12
1  2024-01-11  South        Balu       Pen        10          3
2  2024-01-10   East      Chirag  Notebook         7         12
3  2024-01-12   West        Ajay       Pen        15          3
4  2024-01-11  North        Balu    Binder        20          5
5  2024-01-12   East      Chiraj    Binder        10          5

In [27]:
df1[df1['Region'].isin(['North', 'South'])].pivot_table(index='Product', columns='Region', values='Quantity')

Region    North  South
Product
Binder     20.0    NaN
Notebook    5.0    NaN
Pen         NaN   10.0

# values='Quantity': This specifies the column whose values will be aggregated (summed in this case).

# index='Region': This sets the 'Region' column as the index of the pivot table.

# columns='Product': This sets the 'Product' column as the columns of the pivot table.

### 25. Which of the following statements is/are True

a) .loc method includes the last element when used for slicing.

a) .iloc is primarily integer-location based indexing, and when you use it for slicing, it includes the last element in the specified range.

b) .loc is label-based indexing, and when you use it for slicing, it includes the start but excludes the end.

c) This statement is not entirely accurate. When using .loc for slicing, you typically provide labels (not default integer index values). If you pass integer values, it will interpret them as labels, not default integer positions.

### 26. Using a pivot table is it possible to create a multi-index dataframe ,if so what is the syntax to have a multi index of date and region, with total product sold as values

c) df1.pivot_table(index=['date', 'region'], columns='product', values='quantity', aggfunc='sum')

In [33]:
df1.pivot_table(index=['Date', 'Region'],columns='Product',values='Quantity',aggfunc='sum')

Product            Binder  Notebook   Pen
Date       Region
2024-01-10 East       NaN       7.0   NaN
           North      NaN       5.0   NaN
2024-01-11 North     20.0       NaN   NaN
           South      NaN       NaN  10.0
2024-01-12 East      10.0       NaN   NaN
           West       NaN       NaN  15.0

# columns='Product': This sets the 'Product' column as the columns of the pivot table. Each unique value in the 'Product' column will become a column in the resulting pivot table.

# values='Quantity': This specifies that the values in the pivot table will be taken from the 'Quantity' column of the original DataFrame.

# aggfunc='sum': This specifies the aggregation function to be applied. In this case, it's 'sum', meaning that the values for each combination of 'Date', 'Region', and 'Product' will be summed.

### 27. What does the margins parameter in pivot_table() allows to include in the pivot table

a) additional margins  and subtotals for rows and columns 

b)  a list of column names to exclude from the pivot_table 

c) the numbers of rows and columns to skip at thr beginning of the pivot table 

d) the maximum number of rows and columns to display the pivot table

a) additional margins and subtotals for rows and columns

# The margins parameter in the pivot_table function allows you to include additional margins and subtotals for rows and columns in the resulting pivot table. 

# When you set margins=True, it adds the margins at the end of the rows and columns to display totals for rows, columns, and the grand total.

### 28. If we choose to imputing missing values in Price Col by Chaining ffill() and bfill() while limiting the imputation to 1,1 respectively , how many missing values will be left post imputation

In [69]:
import pandas as pd

There are 3 missing values left after ffill & bfill imputation

In [78]:
df2 = pd.DataFrame({
    'Fruits': ['apple', 'banana', 'apple', 'apple', 'banana', 'apple', 'kiwi', 'kiwi', 'banana', 'apple', 'kiwi', 'apple', 'banana', 'grape', 'apple', 'banana', 'apple', 'apple', 'grape'],
    'Price': ['', '', 205, 200, 40, 210, 300, 320, '', 180, 350, '', 35, '', 215, 40, '', '', '']
})
df2

    Fruits Price
0    apple
1   banana
2    apple   205
3    apple   200
4   banana    40
5    apple   210
6     kiwi   300
7     kiwi   320
8   banana
9    apple   180
10    kiwi   350
11   apple
12  banana    35
13   grape
14   apple   215
15  banana    40
16   apple
17   apple
18   grape

In [79]:
df2['Price'] = pd.to_numeric(df2['Price'])
df2['Price'] = df2['Price'].ffill(limit=1).bfill(limit=1)

In [80]:
df2

    Fruits  Price
0    apple    NaN
1   banana  205.0
2    apple  205.0
3    apple  200.0
4   banana   40.0
5    apple  210.0
6     kiwi  300.0
7     kiwi  320.0
8   banana  320.0
9    apple  180.0
10    kiwi  350.0
11   apple  350.0
12  banana   35.0
13   grape   35.0
14   apple  215.0
15  banana   40.0
16   apple   40.0
17   apple    NaN
18   grape    NaN

In [81]:
x = df2['Price'].isnull().sum()
x

3

### 29. What kind of missing values handling technique is appropriate for df2

a) imputing price col with price mean

b) imputing price col with price median 

c) imputing price col with individual fruits price median

d) dropping missing value

c) imputing price col with individual fruits price median

### 30. If we choose to impute missing values in price col by with individual fruit's price's mean, how many missing values will be post imputation

a) 2

b) 0

c) 1

d) 3

In [82]:
df2['Price'] = df2.groupby('Fruits')['Price'].transform(lambda x: x.fillna(x.mean()))

In [83]:
df2['Price'].isnull().sum()

0

b) 0

### 31. a = pd.Series([np.nan, 1, 2, np.nan, np.nan, np.nan, np.nan, 4, 5, 7]) What will be the output of a.interpolate()

In [84]:
import numpy as np

In [85]:
a=pd.Series([np.nan, 1,2, np.nan, np.nan,np.nan, np.nan, 4, 5, 7])

In [86]:
a # It fills NaN values in the Series using linear interpolation.

0    NaN
1    1.0
2    2.0
3    NaN
4    NaN
5    NaN
6    NaN
7    4.0
8    5.0
9    7.0
dtype: float64

In [87]:
a.interpolate() # The interpolate() function in pandas is applied to the Series 'a'.

0    NaN
1    1.0
2    2.0
3    2.4
4    2.8
5    3.2
6    3.6
7    4.0
8    5.0
9    7.0
dtype: float64

In [89]:
# c) c) [nan,1.0,2.0,2.4,2.8,3.2,3.6,4.0,5.0,7.0]
# The result is a Series with NaN values replaced based on linear interpolation between neighboring non-NaN values.
# the missing values are filled using linear interpolation.
# The missing value at index 0 is not filled because there are no preceding values to interpolate from. 
# Linear interpolation is applied between existing values, and you can see that the NaN values are filled accordingly.

### 32. What is the use of the normalization parameter in the crosstab method of pandas

In [90]:
df = pd.DataFrame({'Age Group': ['26-35', '18-25', '18-25', '26-35', '18-25', '18-25'],
    'Favorite Color': ['Blue', 'Red', 'Red', 'Blue', 'Red', 'Blue'],
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Female', 'Female'],
    'Has Pet': ['Yes', 'Yes', 'Yes', 'Yes', 'Yes', 'No']})
df

  Age Group Favorite Color  Gender Has Pet
0     26-35           Blue    Male     Yes
1     18-25            Red  Female     Yes
2     18-25            Red    Male     Yes
3     26-35           Blue  Female     Yes
4     18-25            Red  Female     Yes
5     18-25           Blue  Female      No

a) It used to normalize values by dividing them by the total count

In [91]:
# In the pd.crosstab method in pandas
# the normalize parameter is used to normalize the values by dividing them by the total count.
# By setting normalize to True, the resulting table will display proportions or percentages instead of counts. 
# This is useful when you want to see the relative frequencies of the cross-tabulated variables.